package me.whiteship.question;

public class Question {


    /*
        핵심역량
        1. 고객중심
        2. 결과 도출
        3. 영향력
        4. 적응력
        5. 판단력
        6. 협업

        STAR 프레임워크
          상황(Situation) - 어떤 상황이였고
          업무(Task) -  ~~ 를 처리해야 했다.
          액션(Action) - 그래서 나는 ~~ 행동을 취했고
          결과(Result)  - 결과적으로 ~~ 됬다

        STAR 프레임워크에 맞춰서 답변하는 연습


        1. 고객중심
           외부 또는 내부 고객의 요구를 만족시켰던 경험? 혹은 그 이상으로 서비스 해준경험 ?

            운영업무를 하면서 문의가 오는경우가 종종있습니다. 그 문의들의 내용을 봤을 때, 현 시스템 구조상에서는 바로 찾기 힘든 정보에 대한 문의가 잦은 빈도로 온다
            저는 그런 문의들에 대한 답변을 하기위해 일정시간 이상을 투자해야 하는데, 그 과정이 되게 잦아지다 보니 하나하나 찾는게 좀더 비 효율적이라고 판단해서
            그 정보에 대한 관리테이블을 만들어서 마이그레이션을 하면 어떻겠냐는 제안을 했었습니다.
            마이그레이션 대상 건수는  뭐 몇십만건 정도 있고, 이중에서 대상자지만 정확한 데이터를 찾지 못하는 회원이 몇건 있다. 하지만 현재까지 살아있는회원이 없어서 크리티컬 하진 않을 것이라고 설득하였고,테이블 생성을 진행하였습니다.
            현재는 해당 테이블로 조회할 수 있는 관리자용 페이지를 만들어서 간단하게 조회 및 수정할 수 있도록 활용하고 있습니다.



        2. 결과 도출 ( 문제를 해결하는데 필요한 정량적인 데이터를 수집해 본 경험. )
             프로젝트 목표를 달성하기 어려웠던 경험에 대해 설명해 주세요. 어떤 문제가 있었나요?





        3. 영향력
            다양한 견해를 가지고 있는 주요 관계자들의 요구를 성공적으로 만족시킨 경험이 있나요?

        4. 적응력
            가이드나 정보가 거의 없이 시작했던 프로젝트를 완료했던 경험이 있나요

        5. 판단력
            업무에서 치명적인 실수를 했던 경험이 있나요?

           저희 시스템이 10년이상된 레거시 시스템이다보니, 소스관리가 좀 덜 되어있는 경우가 많았습니다. 예를들어 기존에 있던 업무에 대상 과목만 추가가 되는데,
           이 작업을 위해 화면딴 소스수정 및 java파일 수정 그리고 서버리스타트까지 진행했어야 했습니다. 서버리스타트를 현업에서 좋게보지는 않습니다.

           어쨋든 이런 비효율적으로 반복하는 작업들이 쌓일수록 점점더 로직은 복잡해지고, 단순한업무에 과도한 리소스가 투자되는게 아닌가 싶어서, 해당 업무를 Oracle Fucntion으로 만들어놓고
           해당 Function을 호출해서 y/n 값만 받을 수 있도록 개선하였습니다. 테스트를 꼼꼼하게 했어야했는데, 누락된 부분이 있었고 실제로 잘못된 데이터가 들어와서 해당 데이터에 대한 원상복구처리를 하는데 시간과 비용을 많이 썼습니다.

           이 경험을 통해서 기존에 사용하던 시스템을 버리고 새로운 구조로 옮겨갈 때, 충분한 테스트기간을 가지고 옮기거나 한번에 다 하지 않고 조금씩 옮겨야겠다 라는 피드백을 받았습니다


        6. 협업
            치명적인 이슈를 해결하는데 필요한 다른 팀과 같이 일했던 경험이 있나요?






     */

}
